{
  "language": "en",
  "language-selector.title": "Select Language",
  "sidepanel.home": "Home",
  "sidepanel.projects": "Projects",
  "sidepanel.CV": "Curriculum Vitae",
  "sidepanel.contact": "Contact",
  "cv.title": "Curriculum Vitae",
  "projects.title": "My Projects",
  "projects.description": "This is a list of my <strong>personal and professional</strong> projects. Most of them were done as a <strong>freelancer, in internships or in personal projects</strong>, where I was able to express my creativity and technical skills to meet the needs of clients. Explore them below:",
  "projects.tecnologies": "Technologies",
  "home.links.intro": "Introduction",
  "home.links.about": "About",
  "home.links.timeline": "Timeline",
  "home.links.skills": "Skills",
  "home.introduction.title": "About Me",
  "home.introduction.paragraph1": "Hello! I'm João Vitor Alves, a web developer with 4 years of experience. My journey began at the age of 13 when I discovered the fascinating world of information security. At that time, I never imagined I would pursue a career as a programmer, but exploring Kali Linux (known as Backtrack Linux at that time) led me to find a personal challenge that motivated me to study further.",
  "home.introduction.paragraph2": "Surprisingly, web development didn't captivate me initially. It was only when I enrolled in the <strong>Software Engineering</strong> course at the University of Brasília at the age of 18 that I began to explore the complexities of web development, especially backend technologies. It was through this exposure that my interest in the field blossomed.",
  "home.introduction.paragraph3": "The beginning of the pandemic provided me with the opportunity to dive deeper into areas beyond my formal education. I took advantage of this chance to expand my horizons and obtained certification in <strong>network security</strong> from the International CyberSecurity Institute. Later, I got an <strong>internship at a digital marketing agency</strong>, working mainly with WordPress. However, as time went on, I gained autonomy and started leading projects independently. I developed the company's time control application in Python and integrated PHP into the websites' codes. Despite my successes, balancing work commitments with university studies became increasingly challenging due to logistical constraints. Consequently, I made the decision to <strong>transfer to the night course of Computer Science</strong> at the Catholic University of Brasília.",
  "home.introduction.paragraph4": "Currently, I work as a <strong>fullstack freelance developer</strong>, focusing mainly on Next.js websites. I take care of everything from API development to frontend design. In addition, I am responsible for database management and project deployment. The versatility and challenge of freelance work appeal to me, allowing me to work on a variety of projects and constantly expand my skill set.",
  "tl.item1.date": "January, 2018",
  "tl.item1.title": "Start of Software Engineering Course",
  "tl.item1.text": "Start of Software Engineering course at the University of Brasília",
  "tl.item2.date": "August, 2020",
  "tl.item2.title": "Certified Network Security Specialist",
  "tl.item2.text": "Certified in network security by the International CyberSecurity Institute (UK)",
  "tl.item3.date": "September, 2020",
  "tl.item3.title": "CyberSecurity Analyst Bootcamp",
  "tl.item3.text": "Cybersecurity analyst bootcamp by IGTI",
  "tl.item4.date": "October, 2020 - October, 2022",
  "tl.item4.title": "Internship at DBS Web",
  "tl.item4.text": "Internship in web development, working as a fullstack developer (Python, PHP, JavaScript, HTML, CSS)",
  "tl.item5.date": "July, 2023",
  "tl.item5.title": "Course Transfer",
  "tl.item5.text": "Transfer from the Software Engineering course to Computer Science at the Catholic University of Brasília",
  "tl.item6.date": "2023 - Current",
  "tl.item6.title": "Freelancer",
  "tl.item6.text": "Working as a fullstack freelance developer",
  "skills.text": "I have experience with a wide range of technologies and tools. Here are some of them:",
  "skills.frontend.title": "Frontend",
  "skills.frontend.text": "My journey into frontend development began with mastering the fundamentals of HTML, CSS, and JavaScript. Over time, I delved deeper into modern frontend frameworks and libraries like React and Next.js to build dynamic and efficient web applications. Additionally, I gained proficiency in styling frameworks like TailwindCSS and Bootstrap, as well as CSS-in-JS solutions like Stitches.",
  "skills.backend.title": "Backend",
  "skills.backend.text": "In backend development, I've acquired proficiency in various technologies to build robust server-side applications. My experience includes working with languages like Python and PHP, along with frameworks like Flask and Node.js with Express. I have extensive knowledge of database management systems like MongoDB, MySQL, PostgreSQL, and Firebase, enabling efficient data manipulation in backend operations. Furthermore, I possess expertise in developing RESTful APIs.",
  "skills.devops.title": "DevOps",
  "skills.devops.text": "In the DevOps area, I utilize tools like Git and GitHub for version control and collaborative development workflows. I have experience in containerization using Docker and I'm proficient in deploying applications on platforms like Vercel.",
  "skills.others.title": "Others",
  "skills.others.text": "In addition to technical skills, I've mastered agile methodologies like Scrum and Kanban, facilitating efficient project management. I utilize tools like Trello and Figma to optimize collaboration and design processes.",
  "skills.proficiency": "Technologies with higher proficiency",
  "projects.hit-the-dot.title": "Hit The Dot",
  "projects.hit-the-dot.description": "Website for 'time clock' with authentication and time control features. Developed with Python, Flask, MySQL, Redis, HTML5, and CSS3.",
  "projects.maryna-carvalho.title": "Maryna Carvalho Law Firm",
  "projects.maryna-carvalho.description": "Website for a law firm, with contact feature. Developed with Next.js and TailwindCSS. Contact made via email with ReSend.",
  "projects.corpo-e-mente.title": "Corpo e Mente Clinical Space",
  "projects.corpo-e-mente.description": "Website for a psychological clinic with scheduling feature and multi-level permission authentication. Developed with Next.js and TailwindCSS(ShadCN). Scheduling implemented entirely from scratch.",
  "projects.spotify-clone.title": "Spotify Clone (In Progress)",
  "projects.spotify-clone.description": "Spotify clone, with functional audio player built from scratch. Developed with Next.js and TailwindCSS.",
  "projects.view-project": "View Project",
  "projects.view-code": "View Code",
  "contact.title": "Get In Touch",
  "contact.socialnetworks": "Social Networks",
  "contact.success": "Your message has been sent!",
  "contact.success-message": "Your message has been sent successfully! I will contact you as soon as possible.",
  "contact.name": "Name",
  "contact.name.placeholder": "Enter your name...",
  "contact.email": "Email",
  "contact.email.placeholder": "Enter your email...",
  "contact.message": "Message",
  "contact.message.placeholder": "Enter your message...",
  "contact.send": "Send",
  "cv.description": "Coming soon..."
}
