{
  "language": "en",
  "language-selector.title": "Select Language",
  "sidepanel.home": "Home",
  "sidepanel.projects": "Projects",
  "sidepanel.CV": "Curriculum Vitae",
  "sidepanel.contact": "Contact",
  "sidepanel.certifications": "Certifications",
  "cv.title": "Curriculum Vitae",
  "projects.title": "My Projects",
  "projects.description": "This is a list of my <strong>personal and professional</strong> projects. Most of them were done as a <strong>freelancer, in internships or in personal projects</strong>, where I was able to express my creativity and technical skills to meet the needs of clients. Explore them below:",
  "projects.tecnologies": "Technologies",
  "home.links.intro": "Introduction",
  "home.links.about": "About",
  "home.links.timeline": "Timeline",
  "home.links.skills": "Skills",
  "home.introduction.title": "About Me",
  "home.introduction.paragraph1": "Hello! I'm João Vitor Alves, a web developer with 4 years of experience. My journey began at the age of 13 when I discovered the fascinating world of information security. At that time, I never imagined I would pursue a career as a programmer, but exploring Kali Linux (known as Backtrack Linux at that time) led me to find a personal challenge that motivated me to study further.",
  "home.introduction.paragraph2": "Surprisingly, web development didn't captivate me initially. It was only when I enrolled in the <strong>Software Engineering</strong> course at the University of Brasília at the age of 18 that I began to explore the complexities of web development, especially backend technologies. It was through this exposure that my interest in the field blossomed.",
  "home.introduction.paragraph3": "The beginning of the pandemic provided me with the opportunity to dive deeper into areas beyond my formal education. I took advantage of this chance to expand my horizons and obtained certification in <strong>network security</strong> from the International CyberSecurity Institute. Later, I got an <strong>internship at a digital marketing agency</strong>, working mainly with WordPress. However, as time went on, I gained autonomy and started leading projects independently. I developed the company's time control application in Python and integrated PHP into the websites' codes. Despite my successes, balancing work commitments with university studies became increasingly challenging due to logistical constraints. Consequently, I made the decision to <strong>transfer to the night course of Computer Science</strong> at the Catholic University of Brasília.",
  "home.introduction.paragraph4": "Currently, I work as a <strong>fullstack freelance developer</strong>, focusing mainly on Next.js websites. I take care of everything from API development to frontend design. In addition, I am responsible for database management and project deployment. The versatility and challenge of freelance work appeal to me, allowing me to work on a variety of projects and constantly expand my skill set.",
  "tl.item1.date": "January, 2018",
  "tl.item1.title": "Start of Software Engineering Course",
  "tl.item1.text": "Start of Software Engineering course at the University of Brasília",
  "tl.item2.date": "August, 2020",
  "tl.item2.title": "Cybersecurity Essentials - Cisco",
  "tl.item2.text": "Course in cybersecurity essentials by Cisco Networking Academy",
  "tl.item3.date": "August, 2020",
  "tl.item3.title": "Certified Network Security Specialist",
  "tl.item3.text": "Certified in network security by the International CyberSecurity Institute (UK)",
  "tl.item4.date": "September, 2020",
  "tl.item4.title": "CyberSecurity Analyst Bootcamp",
  "tl.item4.text": "Cybersecurity analyst bootcamp by IGTI",
  "tl.item5.date": "October, 2020 - October, 2022",
  "tl.item5.title": "Internship at DBS Web",
  "tl.item5.text": "Internship in web development, working as a fullstack developer (Python, PHP, JavaScript, HTML, CSS)",
  "tl.item6.date": "July, 2023",
  "tl.item6.title": "Course Transfer",
  "tl.item6.text": "Transfer from the Software Engineering course to Computer Science at the Catholic University of Brasília",
  "tl.item7.date": "2023 - Current",
  "tl.item7.title": "Freelancer",
  "tl.item7.text": "Working as a fullstack freelance developer",
  "skills.text": "I have experience with a wide range of technologies and tools. Here are some of them:",
  "skills.frontend.title": "Frontend",
  "skills.frontend.text": "My journey into frontend development began with mastering the fundamentals of <strong>HTML</strong>, <strong>CSS</strong>, and <strong>JavaScript</strong>. Over time, I delved deeper into modern frontend frameworks and libraries like <strong>React</strong> and <strong>Next.js</strong> to build dynamic and efficient web applications. Additionally, I gained proficiency in styling frameworks like <strong>TailwindCSS</strong> and <strong>Bootstrap</strong>, as well as CSS-in-JS solutions like <strong>Stitches</strong>.",
  "skills.backend.title": "Backend",
  "skills.backend.text": "In backend development, I've acquired proficiency in various technologies to build robust server-side applications. My experience includes working with languages like <strong>Python</strong> and <strong>PHP</strong>, along with frameworks like <strong>Flask</strong> and <strong>Node.js</strong> with <strong>Express</strong>. I have extensive knowledge of database management systems like <strong>MongoDB</strong>, <strong>MySQL</strong>, <strong>PostgreSQL</strong>, and <strong>Firebase</strong>, enabling efficient data manipulation in backend operations. Furthermore, I possess expertise in developing <strong>'RESTful' APIs</strong>.",
  "skills.devops.title": "DevOps",
  "skills.devops.text": "In the DevOps area, I utilize tools like <strong>Git</strong> and <strong>GitHub</strong> for version control and collaborative development workflows. I have experience in containerization using <strong>Docker</strong> and I'm proficient in deploying applications on platforms like <strong>Vercel</strong>.",
  "skills.others.title": "Others",
  "skills.others.text": "In addition to technical skills, I've mastered agile methodologies like <strong>Scrum</strong> and <strong>Kanban</strong>, facilitating efficient project management. I utilize tools like <strong>Trello</strong> and <strong>Figma</strong> to optimize collaboration and design processes.",
  "skills.proficiency": "Technologies with higher proficiency",
  "projects.kanban.title": "Kanban",
  "projects.kanban.description": "A comprehensive Kanban application allowing users to create numerous boards, each with multiple columns, tasks, and subtasks. The app supports user authentication and includes a drag-and-drop feature for ease of use.",
  "projects.devlinks.title": "DevLinks",
  "projects.devlinks.description": "App for sharing personal social media links. Developed with Next.js and Shadcn. Modern and user-friendly interface to centralize all your social profiles in one place.",
  "projects.hit-the-dot.title": "Hit The Dot",
  "projects.hit-the-dot.description": "Website for 'time clock' with authentication and time control features. Developed with Python, Flask, MySQL, Redis, HTML5, and CSS3.",
  "projects.maryna-carvalho.title": "Maryna Carvalho Law Firm",
  "projects.maryna-carvalho.description": "Website for a law firm, with contact feature. Developed with Next.js and TailwindCSS. Contact made via email with ReSend.",
  "projects.corpo-e-mente.title": "Corpo e Mente Clinical Space",
  "projects.corpo-e-mente.description": "Website for a psychological clinic with scheduling feature and multi-level permission authentication. Developed with Next.js and TailwindCSS(ShadCN). Scheduling implemented entirely from scratch.",
  "projects.spotify-clone.title": "Spotify Clone (In Progress)",
  "projects.spotify-clone.description": "Spotify clone, with functional audio player built from scratch. Developed with Next.js and TailwindCSS.",
  "projects.view-project": "View Project",
  "projects.view-code": "View Code",
  "contact.title": "Get In Touch",
  "contact.socialnetworks": "Social Networks",
  "contact.success": "Your message has been sent!",
  "contact.success-message": "Your message has been sent successfully! I will contact you as soon as possible.",
  "contact.name": "Name",
  "contact.name.placeholder": "Enter your name...",
  "contact.email": "Email",
  "contact.email.placeholder": "Enter your email...",
  "contact.message": "Message",
  "contact.message.placeholder": "Enter your message...",
  "contact.send": "Send",
  "cv.description": "Coming soon...",
  "certifications.viewCertificate": "View Certificate",
  "certifications.showMore": "Show More...",
  "certifications.showLess": "Show Less...",
  "certifications.minor.item1.title": "JavaScript: Programming in the Language of the Web",
  "certifications.minor.item1.institution": "Alura",
  "certifications.minor.item1.description": "This course covers the essential fundamentals of JavaScript, allowing the learner to gain a detailed understanding of this popular programming language. Throughout the course, topics such as manipulation of HTML elements, efficient management of browser events, form validation, and best practices for organizing JavaScript code are explored. Additionally, the learner will acquire the ability to retrieve and integrate data from external servers using AJAX, thus expanding their web development skills.",
  "certifications.minor.item2.title": "Web Accessibility Part 1: Making Your Front-End Inclusive",
  "certifications.minor.item2.institution": "Alura",
  "certifications.minor.item2.description": "Improve your website for screen reader users; Understand how a blind person uses the internet; Learn to test your website using NVDA; Notice how code details can impact people; Implement front-end techniques that can assist your users; Make your project even more inclusive.",
  "certifications.minor.item3.title": "Course on Web Accessibility Part 2: Accessible Components with Some JavaScript",
  "certifications.minor.item3.institution": "Alura",
  "certifications.minor.item3.description": "Enhance your website further for screen reader users; Learn how to make a modal accessible; Understand considerations for your carousel; Recognize how form details can impact people; Write JavaScript code to assist with accessibility.",
  "certifications.minor.item4.title": "Web Accessibility: Creating Inclusive Designs",
  "certifications.minor.item4.institution": "Alura",
  "certifications.minor.item4.description": "HTML, CSS, accessibility, usability, autism, dyslexia, deafness, low vision, physical disabilities, inclusive layouts",
  "certifications.minor.item5.title": "Regular Expressions: Capturing Texts in a Magical Way",
  "certifications.minor.item5.institution": "Alura",
  "certifications.minor.item5.description": "Understand what regular expressions are, Validate HTML forms, Learn to identify CPF, CEP, emails, and other documents, Create efficient regular expressions, Use classes, anchors, quantifiers, and groups, Execute regular expressions in your language",
  "certifications.minor.item6.title": "Visual Design of a Mobile Site with Figma",
  "certifications.minor.item6.institution": "Alura",
  "certifications.minor.item6.description": "Produce a mobile site with concepts focused on visual design. Deal with fonts, colors, and icons to compose the layout. Develop interfaces understanding Nielsen's Heuristics. Work with Figma and understand its workflow. Learn concepts related to UI Design.",
  "certifications.minor.item7.title": "Advanced Web Development with Flask",
  "certifications.minor.item7.institution": "Alura",
  "certifications.minor.item7.description": "Create a complete CRUD, Save data in the database, Implement file upload, Use JavaScript and jQuery in the web application, Organize your project properly",
  "certifications.minor.item8.title": "HTML5 and CSS3 part 1: create a Web page",
  "certifications.minor.item8.institution": "Alura",
  "certifications.minor.item8.description": "Learn what HTML and CSS are. Understand the basic structure of an HTML file. Use the browser to inspect elements. Learn to define styles for elements using CSS. Develop a Web page.",
  "certifications.minor.item9.title": "HTML5 and CSS3 Part 2: Positioning, Lists, and Navigation",
  "certifications.minor.item9.institution": "Alura",
  "certifications.minor.item9.description": "HTML page structure, web page navigation, reset.css, CSS positioning, inline vs. block, borders, CSS pseudo-classes.",
  "certifications.minor.item10.title": "HTML5 and CSS3 part 3: working with forms and tables",
  "certifications.minor.item10.institution": "Alura",
  "certifications.minor.item10.description": "Create complex forms, Work with fields for mobile phones, Present information in tables, Use styles for forms, fields, and tables, Understand hierarchy in CSS, Work with transformations and transitions",
  "certifications.minor.item11.title": "HTML5 and CSS3 part 4: advancing in CSS",
  "certifications.minor.item11.institution": "Alura",
  "certifications.minor.item11.description": "Import external content into your HTML page, such as fonts, videos, and maps, Get to know pseudo-classes and pseudo-elements, Use advanced CSS selectors, Learn how to deal with opacity and shadow, Understand about the Viewport and responsive design",
  "certifications.minor.item12.title": "Java 8: get to know the news of this version",
  "certifications.minor.item12.institution": "Alura",
  "certifications.minor.item12.description": "Understand what changes with Java 8, Learn to traverse a collection with forEach, Reduce the number of lines of your code using Lambda, Do filters and mappings in Collections using the Stream, Work with the new API of Dates, Take your first steps in functional programming",
  "certifications.minor.item13.title": "Java Collections: Mastering Lists, Sets, and Maps",
  "certifications.minor.item13.institution": "Alura",
  "certifications.minor.item13.description": "Go beyond the main classes and methods of Collections, Apply good OO practices in relationships, Don't be afraid of old Iterators anymore, Set or List, which one to use?, Equals or hashCode once and for all",
  "certifications.minor.item14.title": "Java and java.io: Streams, Reader and Writers",
  "certifications.minor.item14.institution": "Alura",
  "certifications.minor.item14.description": "Learn the basics about java.io., Establish inputs and outputs of different streams., Know the difference between binary streams and character streams., Use Java serialization and classes like Scanner, PrintStream, or Properties, Understand charsets and issues with character encoding",
  "certifications.minor.item15.title": "Java and java.lang: program with the Object and String classes",
  "certifications.minor.item15.institution": "Alura",
  "certifications.minor.item15.description": "Use imports and organize your code through packages, Know the meaning of all visibility modifiers and exception handling, Document and distribute your library, Get to know java.lang, Understand immutability and the String class, Learn why the java.lang.Object class exists",
  "certifications.minor.item16.title": "Java and java.util: Collections, Wrappers, and Lambda Expressions",
  "certifications.minor.item16.institution": "Alura",
  "certifications.minor.item16.description": "Learn the fundamentals of Java collections., Explore the power and flexibility of lists., Learn to work with ArrayList, LinkedList, or Vector., Understand how lambda expressions work., Manipulate and sort collections.",
  "certifications.minor.item17.title": "Java Exceptions: learn to create, throw, and handle exceptions",
  "certifications.minor.item17.institution": "Alura",
  "certifications.minor.item17.description": "Get to know the execution stack, Use debug mode, Understand exception handling, Create your own checked and unchecked exceptions, Throw exceptions to change your program's flow",
  "certifications.minor.item18.title": "Java JRE and JDK: compile and execute your program",
  "certifications.minor.item18.institution": "Alura",
  "certifications.minor.item18.description": "JVM? JDK? JRE? What are these acronyms?, Compiling and executing Java code, Learn to use Eclipse, Variables and flow control, Get to know the main types of Java",
  "certifications.minor.item19.title": "Java OO: understanding Object-Oriented Programming",
  "certifications.minor.item19.institution": "Alura",
  "certifications.minor.item19.description": "Master the most used programming paradigm in the job market, Understand what references and objects are, Use instance and class attributes, Define objects through constructors, Learn about encapsulation",
  "certifications.minor.item20.title": "Java Polymorphism: understand inheritance and interfaces",
  "certifications.minor.item20.institution": "Alura",
  "certifications.minor.item20.description": "Reuse code with Inheritance and Composition classes, Implement interface and abstract methods, Understand what Polymorphism is, Learn about method overriding and inheritance, Get to know super and protected",
  "certifications.minor.item21.title": "JavaScript: programming in the language of the web",
  "certifications.minor.item21.institution": "Alura",
  "certifications.minor.item21.description": "Understand more about how this popular language works in the market, Learn to manipulate elements of your page, Work well with browser events, Understand how to use and validate forms, Know good practices for organizing JavaScript code, Fetch data from another server with AJAX",
  "certifications.minor.item22.title": "OWASP Top 10: from Injections to Broken Access Control",
  "certifications.minor.item22.institution": "Alura",
  "certifications.minor.item22.description": "Understand, see examples, and suggestions for fixing the main risks, See some of the various types of Injection, Understand the problem of failed authentications, Protect sensitive data, Review the use of XMLs with external entities, Seek assurances in access control",
  "certifications.minor.item23.title": "OWASP Top 10: Security Misconfiguration, Logging, and Monitoring",
  "certifications.minor.item23.institution": "Alura",
  "certifications.minor.item23.description": "Understand the risks of insecure security configurations, Learn Cross site scripting, Know the risks of deserializations, Understand the risks of using any components, Know the risks of not logging or monitoring logs",
  "certifications.minor.item24.title": "Python: advancing in the language",
  "certifications.minor.item24.institution": "Alura",
  "certifications.minor.item24.description": "Understand more about how this popular language works, Organize your code with functions, Deal with different data structures, Know List comprehensions, Work with files",
  "certifications.minor.item25.title": "Python: advancing in object-oriented programming",
  "certifications.minor.item25.institution": "Alura",
  "certifications.minor.item25.description": "Understand what Duck Typing is and what it's used for, Create abstract classes and use multiple inheritance, Learn about Python's data model, Get to know Mixins and Class Extensions, Understand the difference between __str__ and __repr__",
  "certifications.minor.item26.title": "Python: getting started with the language",
  "certifications.minor.item26.institution": "Alura",
  "certifications.minor.item26.description": "Learn Python 3 in practice, Use PyCharm for development, Create a game to learn the fundamental features of Python 3, Run your code anywhere",
  "certifications.minor.item27.title": "Python: understanding Object-Oriented Programming",
  "certifications.minor.item27.institution": "Alura",
  "certifications.minor.item27.description": "Learn the OO paradigm with Python 3, Apply Object Orientation with attributes, methods, and classes, See how to use properties, Understand encapsulation and cohesion, Know when to make your method private or public",
  "certifications.minor.item28.title": "Redis I: storing keys and values",
  "certifications.minor.item28.institution": "Alura",
  "certifications.minor.item28.description": "Get started in the NoSQL world, Solve problems with Redis, Perform optimized searches, Learn how to collect access statistics, Get to know the bit operators",
  "certifications.minor.item29.title": "Redis II: estruturas e recursos na sua base NoSQL",
  "certifications.minor.item29.institution": "Alura",
  "certifications.minor.item29.description": "Implemente listas no Redis, Trabalhe com uma fila de espera, Entenda recursos como busy wait e pop blocante, Crie ranks de usuários e elementos, Use ordenação com o zrange wishscores",
  "certifications.minor.item30.title": "SQL with MySQL: manipulate and query data",
  "certifications.minor.item30.institution": "Alura",
  "certifications.minor.item30.description": "Learn to install and access the MySQL database, Perform queries with SELECT and filter with WHERE, Add data to the database with INSERT, Update and delete data with UPDATE and DELETE, Structure your tables with CREATE TABLE and ALTER TABLE",
  "certifications.minor.item31.title": "TDD and Java: automated testing with JUnit",
  "certifications.minor.item31.institution": "Alura",
  "certifications.minor.item31.description": "Understand the importance of writing automated tests in an application, Get to know JUnit, the main library for automated testing in Java, Learn to write automated tests with JUnit, Learn to use the TDD process when writing automated tests, Know the main annotations and features of JUnit",
  "certifications.major.item1.title": "Certified Network Security Specialist (CNSS)",
  "certifications.major.item1.institution": "Internation Cybersecurity Institute | ICSI",
  "certifications.major.item1.description": "The Certified Network Security Specialist (CNSS) is a certification offered by the Internation Cybersecurity Institute (ICSI). This certificate validates the skills and knowledge of a professional in network security. Through this course, candidates learn the fundamentals of network security, including cryptography techniques, intrusion prevention, traffic analysis, and protection against cyber threats. The CNSS is internationally recognized and is a valuable credential for professionals looking to advance their careers in cybersecurity.",
  "certifications.major.item2.title": "Develop Accessible Web Applications",
  "certifications.major.item2.institution": "Alura",
  "certifications.major.item2.description": "Enhance user experience with good Accessibility practices. In this training, you will understand the main concepts about Web Accessibility, get to know accessible components using JavaScript, and apply interface improvements with accessible practices.",
  "certifications.major.item3.title": "Learn Java Programming with Object-Oriented Programming",
  "certifications.major.item3.institution": "Alura",
  "certifications.major.item3.description": "Learn to use one of the most popular languages in back-end development, delve into the object-oriented paradigm, and master the main libraries of the Java world. Start your Java studies here! Java is one of the most widely used programming languages in the world, according to the famous TIOBE ranking. It is an object-oriented, cross-platform language and quite comprehensive as it allows the creation of a single program for use on various platforms. The Java platform has gained many different markets - from web to desktop in large companies and governments, through mobile and IoT, but the major Java market today is still the back-end in Web systems. Alura's Java training is a complete learning guide for you to start a career in Java programming. You will learn from the fundamentals of the language with best practices to the essential knowledge for good object-oriented modeling.",
  "certifications.major.item4.title": "Cybersecurity Essentials",
  "certifications.major.item4.institution": "Cisco Networking Academy",
  "certifications.major.item4.description": "The student obtained the student-level credential for completing the Cybersecurity Essentials course taught by the designated instructor. The student proficiently: Described the tactics, techniques, and procedures used by virtual criminals. Described the principles of confidentiality, integrity, and availability, as they relate to data states and digital security countermeasures. Explained the purpose of laws related to cybersecurity. Described technologies, products, and procedures used to protect confidentiality, ensure integrity, and provide high availability. Explained how cybersecurity professionals use technologies, processes, and procedures to defend all network components.",
  "certifications.major.item5.title": "Cybersecurity Analyst Bootcamp",
  "certifications.major.item5.institution": "XP Education (IGTI)",
  "certifications.major.item5.description": "The student successfully completed the 'Cybersecurity Analyst Bootcamp' course, with a duration of 148 hours."
}