{
  "language": "pt-BR",
  "language-selector.title": "Selecione o idioma",
  "sidepanel.home": "Home",
  "sidepanel.projects": "Projetos",
  "sidepanel.CV": "Curriculum Vitae",
  "sidepanel.contact": "Contato",
  "sidepanel.certifications": "Certificações",
  "cv.title": "Curriculum Vitae",
  "projects.title": "Meus Projetos",
  "projects.description": "Esta é uma lista dos meus projetos <strong>pessoais e profissionais</strong>. A maioria foi feita como <strong>freelancer, em estágios ou em projetos pessoais</strong>, onde pude expressar minha criatividade e habilidades técnicas para atender às necessidades dos clientes. Explore-os abaixo:",
  "projects.tecnologies": "Tecnologias",
  "home.links.intro": "Introdução",
  "home.links.about": "Sobre",
  "home.links.timeline": "Linha do Tempo",
  "home.links.skills": "Habilidades",
  "home.introduction.title": "Sobre Mim",
  "home.introduction.paragraph1": "Olá! Eu sou João Vitor Alves, um desenvolvedor web com <strong>4 anos de experiência</strong>. Minha jornada começou aos 13 anos, quando descobri o fascinante mundo da <strong>segurança da informação</strong>. Naquela época, eu nem imaginava que seguiria a carreira de programador, porém, explorando o Kali Linux (naquela época conhecido como Backtrack Linux) eu acabei encontrando um desafio pessoal que me motivou a estudar mais.",
  "home.introduction.paragraph2": "Surpreendentemente, o desenvolvimento web não me cativou inicialmente. Foi apenas quando me matriculei no curso de <strong>Engenharia de Software</strong> na Universidade de Brasília aos 18 anos que comecei a explorar as complexidades do desenvolvimento web, especialmente as tecnologias de backend. Foi por meio dessa exposição que meu interesse pelo campo floresceu.",
  "home.introduction.paragraph3": "O início da pandemia me proporcionou a oportunidade de mergulhar mais fundo em áreas além da minha educação formal. Aproveitei essa chance para expandir meus horizontes e obtive a certificação em <strong>segurança de redes</strong> pelo International CyberSecurity Institute. Posteriormente, consegui um <strong>estágio em uma agência de marketing digital</strong>, trabalhando principalmente com WordPress. No entanto, à medida que o tempo passava, ganhei autonomia e comecei a liderar projetos de forma independente. Desenvolvi a aplicação de controle de tempo da empresa em Python e integrei o PHP nos códigos dos sites. Apesar dos meus sucessos, equilibrar os compromissos de trabalho com os estudos universitários se tornou cada vez mais desafiador devido às restrições logísticas. Consequentemente, tomei a decisão de <strong>transferir para o curso noturno de Ciência da Computação</strong> na Universidade Católica de Brasília.",
  "home.introduction.paragraph4": "Atualmente, trabalho como <strong>desenvolvedor fullstack freelancer</strong>, focando principalmente em sites Next.js. Eu me encarrego de tudo, desde o desenvolvimento da API até o design do frontend. Além disso, sou responsável pela gestão de bancos de dados e pela implantação de projetos. A versatilidade e o desafio do trabalho como freelancer me atraem, permitindo-me trabalhar em uma variedade de projetos e expandir constantemente meu conjunto de habilidades.",
  "tl.item1.date": "Janeiro, 2018",
  "tl.item1.title": "Início do Curso de Engenharia de Software",
  "tl.item1.text": "Início do curso de Engenharia de Software na Universidade de Brasília",
  "tl.item2.date": "Agosto, 2020",
  "tl.item2.title": "Cybersecurity Essentials - Cisco",
  "tl.item2.text": "Curso de segurança cibernética pela Cisco Networking Academy",
  "tl.item3.date": "Agosto, 2020",
  "tl.item3.title": "Especialista Certificado em Segurança de Redes",
  "tl.item3.text": "Certificado em segurança de redes pelo International CyberSecurity Institute (UK)",
  "tl.item4.date": "Setembro, 2020",
  "tl.item4.title": "Bootcamp de Analista de CyberSecurity",
  "tl.item4.text": "Bootcamp de analista de segurança cibernética pelo IGTI",
  "tl.item5.date": "Outubro, 2020 - Outubro, 2022",
  "tl.item5.title": "Estágio na DBS Web",
  "tl.item5.text": "Estágio em desenvolvimento web, atuando como desenvolvedor fullstack (Python, PHP, JavaScript, HTML, CSS)",
  "tl.item6.date": "Julho, 2023",
  "tl.item6.title": "Transferência de Curso",
  "tl.item6.text": "Transferência do curso de Engenharia de Software para Ciência da Computação na Universidade Católica de Brasília",
  "tl.item7.date": "2023 - Atualmente",
  "tl.item7.title": "Freelancer",
  "tl.item7.text": "Atuando como desenvolvedor fullstack freelancer",
  "skills.text": "Eu tenho experiência com uma ampla gama de tecnologias e ferramentas. Aqui estão algumas delas:",
  "skills.frontend.title": "Frontend",
  "skills.frontend.text": "Minha jornada no desenvolvimento frontend começou com a maestria dos fundamentos de <strong>HTML</strong>, <strong>CSS</strong> e <strong>JavaScript</strong>. Com o tempo, aprofundei-me em frameworks e bibliotecas modernas de frontend, como <strong>React</strong> e <strong>Next.js</strong>, para construir aplicações web dinâmicas e eficientes. Além disso, adquiri proficiência em frameworks de estilo como <strong>TailwindCSS</strong> e <strong>Bootstrap</strong>, bem como soluções CSS-in-JS como <strong>Stitches</strong>.",
  "skills.backend.title": "Backend",
  "skills.backend.text": "No desenvolvimento backend, adquiri proficiência em diversas tecnologias para construir aplicações robustas do lado do servidor. Minha experiência inclui trabalhar com linguagens como <strong>Python</strong> e <strong>PHP</strong>, junto com frameworks como <strong>Flask</strong> e <strong>Node.js</strong> com <strong>Express</strong>. Tenho amplo conhecimento em sistemas de gerenciamento de banco de dados como <strong>MongoDB</strong>, <strong>MySQL</strong>, <strong>PostgreSQL</strong> e <strong>Firebase</strong>, permitindo manipulação eficiente de dados nas operações backend. Além disso, possuo expertise no desenvolvimento de <strong>APIs 'RESTful'</strong>.",
  "skills.devops.title": "DevOps",
  "skills.devops.text": "Na área de DevOps, utilizo ferramentas como <strong>Git</strong> e <strong>GitHub</strong> para controle de versão e fluxos de trabalho de desenvolvimento colaborativo. Tenho experiência em containerização usando <strong>Docker</strong> e tenho proficiência em implantar aplicativos em plataformas como <strong>Vercel</strong>.",
  "skills.others.title": "Outros",
  "skills.others.text": "Além das habilidades técnicas, domino metodologias ágeis como <strong>Scrum</strong> e <strong>Kanban</strong>, facilitando a gestão eficiente de projetos. Utilizo ferramentas como <strong>Trello</strong> e <strong>Figma</strong> para otimizar processos de colaboração e design.",
  "skills.proficiency": "Tecnologias com maior proficiência",
  "projects.ip-tracker.title": "IP Tracker",
  "projects.ip-tracker.description": "Uma aplicação de rastreamento de IP que permite aos usuários buscar informações de geolocalização de endereços IP. Desenvolvida com Angular, a aplicação utiliza uma biblioteca de mapas para exibir a localização e faz requisições a APIs de geolocalização para obter dados precisos.",
  "projects.kanban.title": "Kanban",
  "projects.kanban.description": "Uma aplicação Kanban completa que permite aos usuários criar inúmeros quadros, cada um com múltiplas colunas, tarefas e subtarefas. O aplicativo suporta autenticação de usuário e inclui um recurso de arrastar e soltar para facilitar o uso.",
  "projects.devlinks.title": "DevLinks",
  "projects.devlinks.description": "Aplicativo para compartilhamento de links pessoais de redes sociais. Desenvolvido com Next.js e Shadcn. Interface moderna e fácil de usar para centralizar todos os seus perfis sociais em um só lugar.",
  "projects.hit-the-dot.title": "Hit The Dot",
  "projects.hit-the-dot.description": "Site para 'ponto eletrônico' com feature de autenticação e controle de ponto. Desenvolvido com Python, Flask, MySQL, Redis, HTML5 e CSS3.",
  "projects.maryna-carvalho.title": "Maryna Carvalho Advocacia",
  "projects.maryna-carvalho.description": "Site para escritório de advocacia, com feature de contato. Desenvolvido com Next.js e TailwindCSS. Contato feito via e-mail com ReSend.",
  "projects.corpo-e-mente.title": "Espaço Clínico Corpo e Mente",
  "projects.corpo-e-mente.description": "Site para clínica psicológica com feature de agendamento e autenticação com vários níveis de permissão. Desenvolvido com Next.js e TailwindCSS(ShadCN). Agendamento implementado completamente do zero.",
  "projects.spotify-clone.title": "Spotify Clone (Em Progresso)",
  "projects.spotify-clone.description": "Clone do Spotify, player criado do zero e audio funcionais. Desenvolvido com Next.js e TailwindCSS.",
  "projects.view-project": "Ver Projeto",
  "projects.view-code": "Ver Código",
  "contact.title": "Entre em Contato",
  "contact.socialnetworks": "Redes Sociais",
  "contact.success": "Sua mensagem foi enviada!",
  "contact.success-message": "Sua mensagem foi enviada com sucesso! Entrarei em contato o mais breve possível.",
  "contact.name": "Nome",
  "contact.name.placeholder": "Digite seu nome...",
  "contact.email": "Email",
  "contact.email.placeholder": "Digite seu email...",
  "contact.message": "Mensagem",
  "contact.message.placeholder": "Digite sua mensagem...",
  "contact.send": "Enviar",
  "cv.description": "Em breve...",
  "certifications.viewCertificate": "Ver Certificado",
  "certifications.showMore": "Mostrar Mais...",
  "certifications.showLess": "Mostrar Menos...",
  "certifications.minor.item1.title": "JavaScript: programando na linguagem da web",
  "certifications.minor.item1.institution": "Alura",
  "certifications.minor.item1.description": "Este curso aborda os fundamentos essenciais do JavaScript, permitindo que o aluno compreenda detalhadamente o funcionamento desta popular linguagem de programação. Ao longo do curso, são explorados temas como manipulação de elementos HTML, gerenciamento eficiente de eventos do navegador, validação de formulários e boas práticas de organização de código JavaScript. Além disso, o aluno aprende a buscar e integrar dados de servidores externos utilizando AJAX, ampliando assim suas habilidades de desenvolvimento web.",
  "certifications.minor.item2.title": "Acessibilidade web parte 1: tornando seu front-end inclusivo",
  "certifications.minor.item2.institution": "Alura",
  "certifications.minor.item2.description": "Melhore seu site para usuários de leitor de tela; Entenda como uma pessoa cega usa a internet; Aprenda a testar seu site usando o NVDA; Perceba como detalhes no código podem impactar as pessoas; Faça técnicas front-end que podem ajudar seus usuários; Deixe seu projeto ainda mais inclusivo.",
  "certifications.minor.item3.title": "Curso de Acessibilidade Web Parte 2: Componentes Acessíveis com um Pouco de JavaScript",
  "certifications.minor.item3.institution": "Alura",
  "certifications.minor.item3.description": "Melhore ainda mais seu site para usuários de leitor de tela; Descubra como deixar uma modal acessível; Veja alguns cuidados em seu carrossel; Perceba como detalhes em formulários podem impactar as pessoas; Faça códigos JavaScript para ajudar na acessibilidade.",
  "certifications.minor.item4.title": "Acessibilidade web: crie designs inclusivos",
  "certifications.minor.item4.institution": "Alura",
  "certifications.minor.item4.description": "HTML, CSS, acessibilidade, usabilidade, autismo, dislexia, surdez, baixa visão, deficiência física, layouts inclusivos",
  "certifications.minor.item5.title": "Expressões regulares: capturando textos de forma mágica",
  "certifications.minor.item5.institution": "Alura",
  "certifications.minor.item5.description": "Entenda o que são expressões regulares, Valide formulários HTML, Aprenda a identificar CPF, CEP, emails e outros documentos, Crie expressões regulares eficientes, Use classes, âncoras, quantifiers e grupos, Execute expressões regulares na sua linguagem",
  "certifications.minor.item6.title": "Design Visual de Site Mobile com Figma",
  "certifications.minor.item6.institution": "Alura",
  "certifications.minor.item6.description": "Produzir um site mobile com conceitos direcionados para design visual. Lidar com fontes, cores e pictogramas para compor o layout. Desenvolver interfaces entendendo as Heurísticas de Nielsen. Trabalhar com o Figma e entender o seu workflow. Conhecer conceitos direcionados ao UI Design.",
  "certifications.minor.item7.title": "Desenvolvimento Web Avançado com Flask",
  "certifications.minor.item7.institution": "Alura",
  "certifications.minor.item7.description": "Crie um CRUD completo, Salve os dados no banco de dados, Crie um upload de arquivos, Use JavaScript e jQuery na aplicação web, Organize o seu projeto de maneira correta",
  "certifications.minor.item8.title": "HTML5 e CSS3 parte 1: crie uma página da Web",
  "certifications.minor.item8.institution": "Alura",
  "certifications.minor.item8.description": "Aprenda o que é o HTML e o CSS. Entenda a estrutura básica de um arquivo HTML. Utilize o navegador para inspecionar elementos. Aprenda a definir estilos para elementos usando o CSS. Desenvolva uma página Web.",
  "certifications.minor.item9.title": "HTML5 e CSS3 parte 2: posicionamento, listas e navegação",
  "certifications.minor.item9.institution": "Alura",
  "certifications.minor.item9.description": "Estrutura da página HTML, navegação entre páginas web, reset.css, posicionamento pelo CSS, diferença entre inline e block, bordas, pseudo-classes CSS.",
  "certifications.minor.item10.title": "HTML5 e CSS3 parte 3: trabalhando com formulários e tabelas",
  "certifications.minor.item10.institution": "Alura",
  "certifications.minor.item10.description": "Crie formulários complexos, Trabalhe com campos para celulares, Apresente informações em tabelas, Use estilos para formulários, campos e tabelas, Entenda a hierarquia no CSS, Trabalhe com transformações e transições",
  "certifications.minor.item11.title": "HTML5 e CSS3 parte 4: avançando no CSS",
  "certifications.minor.item11.institution": "Alura",
  "certifications.minor.item11.description": "Importe conteúdo externo na sua página HTML, como fontes, vídeos e mapas, Conheça pseudo-classes e pseudo-elementos, Use seletores de CSS avançados, Saiba como lidar com opacidade e sombra, Entenda sobre o Viewport e design responsivo",
  "certifications.minor.item12.title": "Java 8: conheça as novidades dessa versão",
  "certifications.minor.item12.institution": "Alura",
  "certifications.minor.item12.description": "Entenda o que muda com o Java 8, Aprenda a percorrer uma collection com o forEach, Diminua a quantidade de linhas de seu código usando o Lambda, Faça filtros e mapeamentos em Collections usando o Stream, Trabalhe com a nova API de Datas, Dê seus primeiros passos na programação funcional",
  "certifications.minor.item13.title": "Java Collections: Dominando Listas, Sets e Mapas",
  "certifications.minor.item13.institution": "Alura",
  "certifications.minor.item13.description": "Vá além das principais classes e métodos das Collections, Aplique boas práticas de OO nos relacionamentos, Não tenha mais medo dos antigos Iterators, Set ou List, qual utilizar?, Equals ou hashCode de uma vez por todas",
  "certifications.minor.item14.title": "Java e java.io: Streams, Reader e Writers",
  "certifications.minor.item14.institution": "Alura",
  "certifications.minor.item14.description": "Aprenda os fundamentos sobre java.io., Estabeleça entradas e saídas de fluxos diferentes., Saiba a diferença entre fluxos binários e fluxos de caracteres., Use a serialização Java e classe como Scanner, PrintStream ou Properties, Entenda charsets e os problemas no encoding de caracteres",
  "certifications.minor.item15.title": "Java e java.lang: programe com a classe Object e String",
  "certifications.minor.item15.institution": "Alura",
  "certifications.minor.item15.description": "Use imports e organize o seu código através de packages, Saiba o significado de todos os modificadores de visibilidade e tratamento de exceções, Documente e distribua a sua biblioteca, Conheça o java.lang, Entenda a imutabilidade e a classe String, Aprenda para que existe a classe java.lang.Object",
  "certifications.minor.item16.title": "Java e java.util: Coleções, Wrappers e Expressões Lambda",
  "certifications.minor.item16.institution": "Alura",
  "certifications.minor.item16.description": "Aprenda os fundamentos das coleções Java., Explore o poder e flexibilidade das listas., Saiba trabalhar com ArrayList, LinkedList ou Vector., Entenda como funcionam as expressões lambda., Manipule e ordene as coleções.",
  "certifications.minor.item17.title": "Java Exceções: aprenda a criar, lançar e controlar exceções",
  "certifications.minor.item17.institution": "Alura",
  "certifications.minor.item17.description": "Conheça a pilha de execução, Use o modo de depuração (debug), Entenda o tratamento de exceções, Crie suas próprias exceções checked e unchecked, Lança as exceções para mudar o fluxo de seu programa",
  "certifications.minor.item18.title": "Java JRE e JDK: compile e execute o seu programa",
  "certifications.minor.item18.institution": "Alura",
  "certifications.minor.item18.description": "JVM? JDK? JRE? O que são essas siglas?, Compilando e executando código java, Aprenda a usar Eclipse, Variáveis e controle de fluxo, Conheça os principais tipos do Java",
  "certifications.minor.item19.title": "Java OO: entendendo a Orientação a Objetos",
  "certifications.minor.item19.institution": "Alura",
  "certifications.minor.item19.description": "Domine o paradigma de programação mais usado no mercado de trabalho, Entenda o que são referências e objetos, Use atributos, métodos da instância e da classe, Defina objetos através de construtores, Aprenda sobre encapsulamento",
  "certifications.minor.item20.title": "Java Polimorfismo: entenda herança e interfaces",
  "certifications.minor.item20.institution": "Alura",
  "certifications.minor.item20.description": "Reuse código com classes Herança e Composição, Implemente interface e métodos abstratas, Entenda o que é Polimorfismo, Aprenda sobre reescrita e herança de métodos, Conheça super e protected",
  "certifications.minor.item21.title": "JavaScript: programando na linguagem da web",
  "certifications.minor.item21.institution": "Alura",
  "certifications.minor.item21.description": "Entenda mais como funciona esta popular linguagem do mercado, Aprenda a manipular os elementos de sua página, Trabalhe bem com eventos do navegador, Entenda como utilizar e validar formulários, Conheça boas práticas de organização de código Javascript, Busque dados em outro servidor com AJAX",
  "certifications.minor.item22.title": "OWASP Top 10: de Injeções a Controle de Acesso Quebrado",
  "certifications.minor.item22.institution": "Alura",
  "certifications.minor.item22.description": "Entenda, veja exemplos e sugestões de correções para os principais riscos, Veja alguns dos diversos tipos de Injeção, Entenda o problema de autenticações falhas, Proteja dados sensíveis, Reveja a utilização de XMLs com entidades externas, Busque garantias no controle de acesso",
  "certifications.minor.item23.title": "OWASP Top 10: Configuração de segurança incorreta, logging e monitoramento",
  "certifications.minor.item23.institution": "Alura",
  "certifications.minor.item23.description": "Entenda os riscos de configurações inadequadas de segurança, Aprenda Cross site scripting, Saiba dos riscos de deserializações, Entenda os riscos ao utilizar quaisquer componentes, Conheça os riscos de não logar ou monitorar logs",
  "certifications.minor.item24.title": "Python: avançando na linguagem",
  "certifications.minor.item24.institution": "Alura",
  "certifications.minor.item24.description": "Entenda mais como funciona esta linguagem popular, Organize seu código com funções, Lide com diferentes estruturas de dados, Conheça as List comprehensions, Trabalhe com arquivos",
  "certifications.minor.item25.title": "Python: avançando na orientação a objetos",
  "certifications.minor.item25.institution": "Alura",
  "certifications.minor.item25.description": "Entenda o que é Duck Typing e para que serve, Crie classes abstratas e use herança múltipla, Aprenda sobre o modelo de dados do Python, Conheça os Mixin e Extensão de classes, Saiba a diferença entre __str__ e __repr__",
  "certifications.minor.item26.title": "Python: começando com a linguagem",
  "certifications.minor.item26.institution": "Alura",
  "certifications.minor.item26.description": "Aprenda Python 3 na prática, Use PyCharm para desenvolver, Crie um jogo para aprender os recursos fundamentais do Python 3, Rode o seu código em qualquer lugar",
  "certifications.minor.item27.title": "Python: entendendo a Orientação a Objetos",
  "certifications.minor.item27.institution": "Alura",
  "certifications.minor.item27.description": "Aprenda o paradigma OO com Python 3, Aplique Orientação a objetos com atributos, métodos e classes, Veja como usar propriedades, Entenda encapsulamento e coesão, Saiba quando deixar o seu método privado ou público",
  "certifications.minor.item28.title": "Redis I: armazenando chaves e valores",
  "certifications.minor.item28.institution": "Alura",
  "certifications.minor.item28.description": "Inicie no mundo NoSQL, Resolva problemas com Redis, Faça buscas otimizadas, Aprenda como coletar estatísticas de acesso, Conheça os operadores com bit",
  "certifications.minor.item29.title": "Redis II: structures and features in your NoSQL base",
  "certifications.minor.item29.institution": "Alura",
  "certifications.minor.item29.description": "Implement lists in Redis, Work with a waiting queue, Understand features like busy wait and blocking pop, Create user and element ranks, Use sorting with zrange withscores",
  "certifications.minor.item30.title": "SQL com MySQL: manipule e consulte dados",
  "certifications.minor.item30.institution": "Alura",
  "certifications.minor.item30.description": "Saiba instalar e acessar o banco de dados MySQL, Realize consultas com SELECT e filtre com WHERE, Adicione dados no banco com o INSERT, Atualize e apague dados com UPDATE e DELETE, Estruture suas tabelas com CREATE TABLE e ALTER TABLE",
  "certifications.minor.item31.title": "TDD e Java: testes automatizados com JUnit",
  "certifications.minor.item31.institution": "Alura",
  "certifications.minor.item31.description": "Entenda a importância de escrever testes automatizados em uma aplicação, Conheça o JUnit, principal biblioteca para testes automatizados em Java, Aprenda a escrever testes automatizados com JUnit, Aprenda a utilizar o processo de TDD ao escrever testes automatizados, Conheça as principais anotações e recursos do JUnit",
  "certifications.major.item1.title": "Certified Network Security Specialist (CNSS)",
  "certifications.major.item1.institution": "Internation Cybersecurity Institute | ICSI",
  "certifications.major.item1.description": "O Certified Network Security Specialist (CNSS) é uma certificação oferecida pelo Internation Cybersecurity Institute (ICSI). Este certificado valida as habilidades e conhecimentos de um profissional em segurança de redes. Através deste curso, os candidatos aprendem os fundamentos da segurança de rede, incluindo técnicas de criptografia, prevenção de intrusões, análise de tráfego e proteção contra ameaças cibernéticas. O CNSS é reconhecido internacionalmente e é uma credencial valiosa para profissionais que buscam avançar em suas carreiras em segurança cibernética.",
  "certifications.major.item2.title": "Desenvolva aplicações Web Acessíveis",
  "certifications.major.item2.institution": "Alura",
  "certifications.major.item2.description": "Melhore a experiência dos usuários com boas práticas de Acessibilidade. Nesta formação, você entenderá os principais conceitos sobre Acessibilidade Web, conhecerá componentes acessíveis utilizando o Javascript e aplicará melhorias de interface com práticas acessíveis.",
  "certifications.major.item3.title": "Aprenda a programar em Java com Orientação a Objetos",
  "certifications.major.item3.institution": "Alura",
  "certifications.major.item3.description": "Aprenda a usar uma das linguagens mais populares no desenvolvimento back-end, mergulhe no paradigma da orientação a objetos e domine as principais bibliotecas do mundo Java. Comece aqui seus estudos em Java! Java é uma das linguagens de programação mais usadas no mundo, segundo o famoso ranking da TIOBE. É uma linguagem orientada a objetos, multiplataforma e bastante completa por permitir a criação de um programa único para uso em diversas plataformas. A plataforma Java ganhou muitos mercados diferentes - da web ao desktop em grandes empresas e governos, passando por mobile e IoT mas o grande mercado Java hoje ainda é o back-end em sistemas Web. A formação Java da Alura é um guia de aprendizado completo para você iniciar uma carreira na programação Java. Você vai aprender desde os fundamentos da linguagem com as boas práticas até o conhecimento essencial para uma boa modelagem orientada a objetos.",
  "certifications.major.item4.title": "Cybersecurity Essentials",
  "certifications.major.item4.institution": "Cisco Networking Academy",
  "certifications.major.item4.description": "O aluno obteve a credencial de nível de aluno por concluir o curso Cybersecurity Essentials ministrado pelo instrutor designado. O aluno conseguiu, com proficiência: Descrever a tática, as técnicas e os procedimentos usados por criminosos virtuais. Descrever os princípios de confidencialidade, integridade e disponibilidade, da forma que estão relacionados aos estados dos dados e às contramedidas de segurança digital. Explicar a finalidade das leis relacionadas à segurança cibernética. Descrever tecnologias, produtos e procedimentos usados para proteger a confidencialidade, garantir a integridade e fornecer alta disponibilidade. Explicar como os profissionais da segurança cibernética usam tecnologias, processos e procedimentos para defender todos os componentes da rede.",
  "certifications.major.item5.title": "Bootcamp de Analista de CyberSecurity",
  "certifications.major.item5.institution": "XP Educação (IGTI)",
  "certifications.major.item5.description": "O aluno concluiu com sucesso o curso 'Bootcamp Analista de Cybersecurity', com duração de 148 horas."
}