{
  "language": "pt-BR",
  "language-selector.title": "Selecione o idioma",
  "sidepanel.home": "Home",
  "sidepanel.projects": "Projetos",
  "sidepanel.CV": "Curriculum Vitae",
  "sidepanel.contact": "Contato",
  "cv.title": "Curriculum Vitae",
  "projects.title": "Meus Projetos",
  "projects.description": "Esta é uma lista dos meus projetos <strong>pessoais e profissionais</strong>. A maioria foi feita como <strong>freelancer, em estágios ou em projetos pessoais</strong>, onde pude expressar minha criatividade e habilidades técnicas para atender às necessidades dos clientes. Explore-os abaixo:",
  "projects.tecnologies": "Tecnologias",
  "home.links.intro": "Introdução",
  "home.links.about": "Sobre",
  "home.links.timeline": "Linha do Tempo",
  "home.links.skills": "Habilidades",
  "home.introduction.title": "Sobre Mim",
  "home.introduction.paragraph1": "Olá! Eu sou João Vitor Alves, um desenvolvedor web com <strong>4 anos de experiência</strong>. Minha jornada começou aos 13 anos, quando descobri o fascinante mundo da <strong>segurança da informação</strong>. Naquela época, eu nem imaginava que seguiria a carreira de programador, porém, explorando o Kali Linux (naquela época conhecido como Backtrack Linux) eu acabei encontrando um desafio pessoal que me motivou a estudar mais.",
  "home.introduction.paragraph2": "Surpreendentemente, o desenvolvimento web não me cativou inicialmente. Foi apenas quando me matriculei no curso de <strong>Engenharia de Software</strong> na Universidade de Brasília aos 18 anos que comecei a explorar as complexidades do desenvolvimento web, especialmente as tecnologias de backend. Foi por meio dessa exposição que meu interesse pelo campo floresceu.",
  "home.introduction.paragraph3": "O início da pandemia me proporcionou a oportunidade de mergulhar mais fundo em áreas além da minha educação formal. Aproveitei essa chance para expandir meus horizontes e obtive a certificação em <strong>segurança de redes</strong> pelo International CyberSecurity Institute. Posteriormente, consegui um <strong>estágio em uma agência de marketing digital</strong>, trabalhando principalmente com WordPress. No entanto, à medida que o tempo passava, ganhei autonomia e comecei a liderar projetos de forma independente. Desenvolvi a aplicação de controle de tempo da empresa em Python e integrei o PHP nos códigos dos sites. Apesar dos meus sucessos, equilibrar os compromissos de trabalho com os estudos universitários se tornou cada vez mais desafiador devido às restrições logísticas. Consequentemente, tomei a decisão de <strong>transferir para o curso noturno de Ciência da Computação</strong> na Universidade Católica de Brasília.",
  "home.introduction.paragraph4": "Atualmente, trabalho como <strong>desenvolvedor fullstack freelancer</strong>, focando principalmente em sites Next.js. Eu me encarrego de tudo, desde o desenvolvimento da API até o design do frontend. Além disso, sou responsável pela gestão de bancos de dados e pela implantação de projetos. A versatilidade e o desafio do trabalho como freelancer me atraem, permitindo-me trabalhar em uma variedade de projetos e expandir constantemente meu conjunto de habilidades.",
  "tl.item1.date": "Janeiro, 2018",
  "tl.item1.title": "Início do Curso de Engenharia de Software",
  "tl.item1.text": "Início do curso de Engenharia de Software na Universidade de Brasília",
  "tl.item2.date": "Agosto, 2020",
  "tl.item2.title": "Especialista Certificado em Segurança de Redes",
  "tl.item2.text": "Certificado em segurança de redes pelo International CyberSecurity Institute (UK)",
  "tl.item3.date": "Setembro, 2020",
  "tl.item3.title": "Bootcamp de Analista de CyberSecurity",
  "tl.item3.text": "Bootcamp de analista de segurança cibernética pelo IGTI",
  "tl.item4.date": "Outubro, 2020 - Outubro, 2022",
  "tl.item4.title": "Estágio na DBS Web",
  "tl.item4.text": "Estágio em desenvolvimento web, atuando como desenvolvedor fullstack (Python, PHP, JavaScript, HTML, CSS)",
  "tl.item5.date": "Julho, 2023",
  "tl.item5.title": "Transferência de Curso",
  "tl.item5.text": "Transferência do curso de Engenharia de Software para Ciência da Computação na Universidade Católica de Brasília",
  "tl.item6.date": "2023 - Atualmente",
  "tl.item6.title": "Freelancer",
  "tl.item6.text": "Atuando como desenvolvedor fullstack freelancer",
  "skills.text": "Eu tenho experiência com uma ampla gama de tecnologias e ferramentas. Aqui estão algumas delas:",
  "skills.frontend.title": "Frontend",
  "skills.frontend.text": "Minha jornada no desenvolvimento frontend começou com a maestria dos fundamentos de HTML, CSS e JavaScript. Com o tempo, aprofundei-me em frameworks e bibliotecas modernas de frontend, como React e Next.js, para construir aplicações web dinâmicas e eficientes. Além disso, adquiri proficiência em frameworks de estilo como TailwindCSS e Bootstrap, bem como soluções CSS-in-JS como Stitches.",
  "skills.backend.title": "Backend",
  "skills.backend.text": "No desenvolvimento backend, adquiri proficiência em diversas tecnologias para construir aplicações robustas do lado do servidor. Minha experiência inclui trabalhar com linguagens como Python e PHP, junto com frameworks como Flask e Node.js com Express. Tenho amplo conhecimento em sistemas de gerenciamento de banco de dados como MongoDB, MySQL, PostgreSQL e Firebase, permitindo manipulação eficiente de dados nas operações backend. Além disso, possuo expertise no desenvolvimento de APIs RESTful.",
  "skills.devops.title": "DevOps",
  "skills.devops.text": "Na área de DevOps, utilizo ferramentas como Git e GitHub para controle de versão e fluxos de trabalho de desenvolvimento colaborativo. Tenho experiência em containerização usando Docker e tenho proficiência em implantar aplicativos em plataformas como Vercel.",
  "skills.others.title": "Outros",
  "skills.others.text": "Além das habilidades técnicas, domino metodologias ágeis como Scrum e Kanban, facilitando a gestão eficiente de projetos. Utilizo ferramentas como Trello e Figma para otimizar processos de colaboração e design.",
  "skills.proficiency": "Tecnologias com maior proficiência",
  "projects.hit-the-dot.title": "Hit The Dot",
  "projects.hit-the-dot.description": "Site para 'ponto eletrônico' com feature de autenticação e controle de ponto. Desenvolvido com Python, Flask, MySQL, Redis, HTML5 e CSS3.",
  "projects.maryna-carvalho.title": "Maryna Carvalho Law Firm",
  "projects.maryna-carvalho.description": "Site para escritório de advocacia, com feature de contato. Desenvolvido com Next.js e TailwindCSS. Contato feito via e-mail com ReSend.",
  "projects.corpo-e-mente.title": "Corpo e Mente Clinical Space",
  "projects.corpo-e-mente.description": "Site para clínica psicológica com feature de agendamento e autenticação com vários níveis de permissão. Desenvolvido com Next.js e TailwindCSS(ShadCN). Agendamento implementado completamente do zero.",
  "projects.spotify-clone.title": "Spotify Clone (Em Progresso)",
  "projects.spotify-clone.description": "Clone do Spotify, player criado do zero e audio funcionais. Desenvolvido com Next.js e TailwindCSS.",
  "projects.view-project": "Ver Projeto",
  "projects.view-code": "Ver Código",
  "contact.title": "Entre em Contato",
  "contact.socialnetworks": "Redes Sociais",
  "contact.success": "Sua mensagem foi enviada!",
  "contact.success-message": "Sua mensagem foi enviada com sucesso! Entrarei em contato o mais breve possível.",
  "contact.name": "Nome",
  "contact.name.placeholder": "Digite seu nome...",
  "contact.email": "Email",
  "contact.email.placeholder": "Digite seu email...",
  "contact.message": "Mensagem",
  "contact.message.placeholder": "Digite sua mensagem...",
  "contact.send": "Enviar",
  "cv.description": "Em breve..."
}
